cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        // value           nonuniform ((0 -1.0 0) (0 -0.9 0) (0 -0.8 0) (0 -0.7 0) (0 -0.6 0) (0 -0.5 0) (0 -0.4 0) (0 -0.3 0) (0 -0.2 0) (0 -0.1 0) (0 0.1 0) (0 0.2 0) (0 0.3 0) (0 0.4 0) (0 0.5 0) (0 0.6 0) (0 0.7 0) (0 0.8 0) (0 0.9 0) (0 1.0 0) );
        // value           nonuniform ((1 -1.0 0) (1 -0.9 0) (1 -0.8 0) (1 -0.7 0) (1 -0.6 0) (1 -0.5 0) (1 -0.4 0) (1 -0.3 0) (1 -0.2 0) (1 -0.1 0) (1 0.1 0) (1 0.2 0) (1 0.3 0) (1 0.4 0) (1 0.5 0) (1 0.6 0) (1 0.7 0) (1 0.8 0) (1 0.9 0) (1 1.0 0) );
        // value           uniform (1 0 0);
        // value           nonuniform ((1 1.2 0) (1 0.3 0) (1 -0.5 0) (1 -1 0));
        value           nonuniform ((1 1 0) (1 -1 0));
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
