cavity/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=$(getApplication)

runApplication blockMesh
# runApplication fluentMeshToFoam elbow.msh
runApplication ../icoFoam.exe
# runApplication foamMeshToFluent
# runApplication foamDataToFluent

#------------------------------------------------------------------------------
